#include <iostream>
#include <math.h>
#include <Windows.h>
#include <fstream>
#include <string>

using namespace std;
int main()

{
    // * змінні
    const double pi = atan(1.0)*4;

    double  X = 0, Y = 0, steps = 0;

    int actions = 0, direction = 0, language = 0, textORconsole = 0, textABOconsol = 0, exit = 0;

    // * вибір мови

    cout << "Which language? " << endl << "1. Ukrainian" << endl << "2. English" << endl;
    cout << "Your language: ";
    cin >> language;

    switch(language)
    {
        // * українське меню

        case 1:
        cout << "Що ви хочете зробити? "<< endl << "1. Робота з текстовим файлом" << endl << "2. Робота з консоллю" << endl << "3. Перегляд інструкції" << endl << "4. Зміна зовнішнього вигляду консолі" << endl << "5. Вихід з програми" << endl;
        cout << "Вибрано пункт: ";
        cin >> textABOconsol;

        switch(textABOconsol)
        {
            // * український файл

            case 1:
                {
                ifstream cin("mapa.txt"); // відкриваю файл на читання
                ofstream cout("skarb.txt"); // відкриваю файл на вивід

                    if(!cin.is_open())
                    {
                        cerr << "You don't have «mapa.txt»!" << endl;
                        return 1;
                    }
                    // якщо файлу "мапа.тхт" не існує, то видає помилку і закриває прогу
                    if(!cout.is_open())
                    {
                        cerr << "You don't have «scarb.txt»!" << endl;
                        return 1;
                    }
                    // якщо файлу "скарб.тхт" не існує, то видає помилку і закриває прогу

                        cin>>actions;

                        for(int i=1; i<=actions; i++)
                        {

                        cin>>direction>>steps;

                        X = X + sin(pi/4 * (direction-1)) * steps;

                        Y = Y + cos(pi/4 * (direction-1))  *steps;
                        }

                        if (abs(X) < 0.001)
                            X=0;
                        if (abs(Y) < 0.001)
                            Y=0;

                        cout.precision(3); // amount of numbers after the comma
                        cout << fixed << "Скарб знаходиться за координатами: " << endl << X << " " << Y << endl;

                        cin.close();
                        cout.close();
                        cout << "Координату обраховано, закриваю програму..." << endl;
                        
                break;
                }

            // * українська консолька
            case 2: 
                {
                    cout << "Введіть кількість дій: ";
                    cin >> actions;
                    cout << "Кількість дій: " << actions << endl;

                    for (int i = 1; i <= actions; i++)
                    {
                        cout << "Введіть напрямок і кількість кроків: ";
                        cin >> direction >> steps;

                        X = X + sin(pi/4 * (direction-1)) * steps;
                        Y = Y + cos(pi/4 * (direction-1)) * steps;
                    }

                    if (abs(X)<0.001)
                            X=0;
                        if (abs(Y)<0.001)
                            Y=0;

                    cout.precision(4);
                    cout << "Скарб знаходиться за координатами: " << X <<" "<< Y << endl;
                    break;
                }
            // * українська інструкція
            // ! хотілось би зробити якісь бордери для нормальної читабельності тексту
            // ? наче зробив більш-менш
            case 3:
                {
                    cout << "Інструкція:" << endl << "Знайти закопаний піратами скарб просто: все, що для цього потрібно – це карта. Як відомо, пірати зазвичай малюють карти від руки і описують алгоритм знаходження скаобу так:\n«Встаньте спиною близько самотньої пальми. Пройдіть тридцять кроків у бік лісу, потім сімнадцять кроків у бік озера, ..., нарешті десять кроків в бік великого кругляка. Скарб знаходиться під ним».\nВелика частина таких вказівок просто зводиться до проходження певної кількості кроків в одному з восьми напрямків (1 - північ, 2 - північний схід, 3 - схід, 4 - південний схід, 5 - південь, 6 - південний захід, 7 - захід, 8 - північний захід). Довжина кроку в будь-якому напрямку дорівнює 1." << endl << "\nПри виборі відповідного пункту меню ви зможете: " << endl << "\n1. Працювати з файлами. Програма зчитує дані з файлу mapa.txt. У нього ви маєте завчасно ввести необхідні для правильної роботи програми дані у такому форматі:\nУ перший рядок вводиться кількість вказівок (число від 1 до 40), далі у певну кількість рядків, відповідно кількості вказівок, через Enter вказується напрям руху (цифру від 1 до 8) та кількість кроків у цьому напрямку (від 1 до 1000). Вказівки мають вводитись у форматі «напрям_руху [пробіл] кількість_кроків». У файлі skarb.txt ви побачите відповідь – кінцеву координату скарбу." << endl << "\n2. Також ви можете працювати через консоль. Там, відповідно до тексту-запиту, ви вводите необхідні дані (вказівки – від 1 до 40, напрям руху – цифру від 1 до 8, кількість кроків у цьому напрямку – від 1 до 1000). Формат вводу даних – «напрям_руху [пробіл] кількість_кроків». Кінцева координата теж виводиться у консоль." << endl << "\n3. Переглянути інструкцію до програми (що ви зараз і робите)." << endl << "\n4. Можливість зміни зовнішнього вигляду консолі: колір фону (обираєте потрібний номер з списку), колір шрифту (обираєте потрібний номер з списку), розмір шрифту." << endl << "\n5. Здійснити вихід з програми" << endl;
                    break;
                }
            case 5: 
            {
                cout << "Закриваю програму..." << endl;
                //? Краще зразу закривати чи через паузу?
                system("PAUSE");
                return 0;
            }
        }
    system("PAUSE");
    return 0;
    
    // * англійське меню
    case 2:
        {
            cout << "Do you want to work with text file or with console? "<< endl << "1. Text file" << endl << "2. Console" << endl;
            cin >> textORconsole;

            switch(textORconsole)
            {
                // * англ файл
                case 1:
                {
                    ifstream cin("mapa.txt");
                    ofstream cout("skarb.txt");

                        cin>>actions;

                        for(int i=1; i<=actions; i++)

                        { cin>>direction>>steps;

                        X=X+sin(pi/4*(direction-1))*steps;

                        Y=Y+cos(pi/4*(direction-1))*steps;

                        }

                        if (abs(X)<0.001)
                            X=0;
                        if (abs(Y)<0.001)
                            Y=0;

                        cout.precision(3); // amount of numbers after the comma
                        cout << fixed << "Coordinates of treasure: " << endl << X << " " << Y << endl;
                    break;
                    exit;                
                }
                // * англ консолька
                case 2:
                {
                    setlocale(LC_ALL, "English");
                    cout << "Enter amount of actions: ";
                    cin >> actions;
                    cout << "Amount of actions: " << actions << endl;

                    for (int i = 1; i <= actions; i++)
                    {
                        cout << "Enter direction and steps: ";
                        cin >> direction >> steps;

                        X = X + sin(pi/4 * (direction-1)) * steps;
                        Y = Y + cos(pi/4 * (direction-1)) * steps;
                    }

                    if (abs(X)<0.001)
                            X=0;
                        if (abs(Y)<0.001)
                            Y=0;

                    cout.precision(4);
                    cout << "Treasure: " << X <<" "<< Y << endl;

                // * англ інструкція
                // ! ТРЕБА ПЕРЕКЛАСТИ НА АНГЛ!!!!
                case 3:
                    {
                        cout << "Інструкція:" << endl << "Знайти закопаний піратами скарб просто: все, що для цього потрібно – це карта. Як відомо, пірати зазвичай малюють карти від руки і описують алгоритм знаходження скаобу так : «Встаньте спиною близько самотньої пальми. Пройдіть тридцять кроків у бік лісу, потім сімнадцять кроків у бік озера, ..., нарешті десять кроків в бік великого кругляка. Скарб знаходиться під ним». елика частина таких вказівок просто зводиться до проходження якоїсь кількості кроків в одному з восьми напрямків (1 - північ, 2 - північний схід, 3 - схід, 4 - південний схід, 5 - південь, 6 - південний захід, 7 - захід, 8 - північний захід). Довжина кроку в будь-якому напрямку дорівнює 1." << endl << "При виборі відповідного пункту меню ви зможете: " << endl << "1. Працювати з файлами. Програма зчитує з файлу mapa.txt, у який ви завчасно, у перший рядок, вводите кількість вказівок (від 1 до 40), а далі напрям руху (цифру від 1 до 8) та кількість кроків у цьому напрямку (від 1 до 1000). Ці вказівки вводять як «напрямок кількість_кроків», і з нового рядка прописується кількість рядків, відповідно до кількості введених вами команд. У файлі skarb.txt ви побачите відповідь – кінцеву координату скарбу." << endl << "2. Також ви можете працювати через консоль. Там, відповідно до тексту-запиту, ви вводите необхідні дані (вказівки – від 1 до 40, напрям руху – цифру від 1 до 8, кількість кроків у цьому напрямку – від 1 до 1000). Кінцева координата теж виводиться у консоль." << endl << "3. Переглянути інструкцію до програми (що ви зараз і робите)." << endl << "4. Можливість зміни зовнішнього вигляду консолі: колір фону ()" << endl;
                    }
                }
            }
        }
    }
    system("PAUSE");
    return 0;
}